#ifndef CCONSTANTS_H
#define CCONSTANTS_H

#include <QStringList>

const QStringList ListAct = { "КЗОТ | Решение общетрудовых вопросов", "ОБР | Решение отраслевых вопросов (образования)",
                              "ОТС | Решение по вопросам Отраслевого соглашения",
                              "ТРОТС | решение по вопросам Территориального соглашения" };
const QStringList ListRazd = { "ПСП | Социальное партнерство",
                               "ДОГ | Трудовой договор, занятость",
                               "РВ | Рабочее время",
                               "ВО | Время отдыха",
                               "ГДП | Гарантии профкома",
                               "ЗП | Заработная плата",
                               "ОТ | Охрана труда",
                               "ТСП | Трудовые споры",
                               "СЦ | Социально-бытовое обслуживание",
                               "ТОК | Труд отдельных категорий работников",
                               "ПР | Произв. экон. вопросы" };
const QStringList ListQuality = { "Ан | Аналоги положений",
                                  "Ут | Уточнение положений",
                                  "До | Реализация дозволений",
                                  "Вы | Повышение условий",
                                  "Св | Свои, специфические проблемы",
                                  "Др | Другое",
                                  "Фр | Формулировка",
                                  "Ни | Понижение условий" };
const QStringList AbbreviationAct = { "КЗОТ", "ОБР", "ОТС", "ТРОТС" };
const QStringList AbbreviationRazd = { "ПСП", "ДОГ", "РВ", "ВО", "ГДП", "ЗП", "ОТ", "ТСП", "СЦ", "ТОК", "ПР" };
const QStringList AbbreviationQuality = { "Ан", "Ут", "До", "Вы", "Св", "Др", "Фр", "Ни" };

//!==============================================ВОПРОСЫ==============================================
//! ПСП | Социальное партнерство
const QStringList QuestionsPSP = { "Стороны и их полномочия",
                                   "Разрешение споров",
                                   "Изменение, заключение и контроль КД",
                                   "Ответственность сторон",
                                   "Сроки и действие КД",
                                   "Консультация, переговоры сторон",
                                   "Цель заключения, правовые основы",
                                   "Информирование и знакомство с КД",
                                   "Обязательства сторон",
                                   "Другие вопросы",
                                   "Определения, содержание КД" };
const QStringList ABRQuestionsPSP = { "ПЛН", "РСП", "ИЗК", "ОТВ", "СДД", "ПЕГ", "ЦЕЗ", "ИНФ", "ОБЯ", "ДРГ", "ОПР" };

//! ДОГ | Трудовой договор, занятость
const QStringList QuestionsDOG = { "Заключение ТД",       "Срок ТД",    "Изменение ТД", "Повышение квалификации",
                                   "Занятость",           "Увольнение", "Сокращение",   "Гарантия, компенсации",
                                   "Обязательства сторон" };
const QStringList ABRQuestionsDOG = { "ЗТД", "СТД", "ИТД", "ПК", "ЗАН", "УВ", "СОК", "ГАР", "ОБЯ" };

//! РВ | Рабочее время
const QStringList QuestionsRV = { "Продолжительность РВ", "Режим работы", "Сверхурочные",
                                  "Нормирование труда",   "Дисциплина",   "Гарантии, компенсации",
                                  "Обязательства сторон" };
const QStringList ABRQuestionsRV = { "ПР", "РЕЖ", "СВХ", "НОР", "ДИС", "ГАР", "ОБЯ" };

//! ВО | Время отдыха
const QStringList QuestionsVO = { "Перерыв в течение рабочего дня", "Выходные дни",          "Ежегодный отпуск",
                                  "Дополнительный отпуск",          "Гарантии, компенсации", "Обязательства сторон" };
const QStringList ABRQuestionsVO = { "ПЕР", "ВЫХ", "ОТП", "ДОВ", "ГАР", "ОБЯ" };

//! ГДП | Гарантии профкома
const QStringList QuestionsGDP = { "Права профкома, профсоюза",
                                   "Условия предоставляемые для деятельности",
                                   "Не члены профсоюза",
                                   "Льготы неосвобожденному профактиву",
                                   "Льготы освобожденному профактиву",
                                   "Согласования",
                                   "Льготы членам профсоюза",
                                   "Обязательства сторон" };
const QStringList ABRQuestionsGDP = { "ПКМ", "УСЛ", "НЧП", "ЛГН", "ЛГО", "СГЛ", "ЛЧП", "ОБГ" };

//! ЗП | Заработная плата
const QStringList QuestionsZP = { "Система оплаты",
                                  "Надбавки",
                                  "Доплаты за не нормальные условия",
                                  "Сроки выплат",
                                  "Индексация",
                                  "Внебюджетные средства",
                                  "Премии",
                                  "Гарантии, компенсации",
                                  "Обязательства сторон" };
const QStringList ABRQuestionsZP = { "СИС", "НАД", "ДОП", "СРК", "ИНД", "ВНБ", "ПРМ", "ГАР", "ОБЯ" };

//! ОТ | Охрана труда
const QStringList QuestionsOT = { "Средства на ОТ",
                                  "Соглашение по ОТ",
                                  "Мероприятия по улучшению ОТ",
                                  "Аттестация рабочих мест",
                                  "Обеспечение средствами защиты",
                                  "Страхование и проф. обследование",
                                  "Контроль за ОТ",
                                  "Гарантии, компенсации",
                                  "Обязательства сторон",
                                  "Ответственность сторон" };
const QStringList ABRQuestionsOT = { "СУМ", "СОГ", "МЕР", "АТТ", "ИСЗ", "ПРФ", "КОН", "ГАР", "ОБЯ", "ОТВ" };

//! ТСП | Трудовые споры
const QStringList QuestionsTSP = { "Обращения, жалобы", "Индивидуальные", "Коллективные", "Комиссия по труд. спорам" };
const QStringList ABRQuestionsTSP = { "ЖЛБ", "ИНД", "КОЛ", "КОМ" };

//! СЦ | Социально-бытовое обслуживание
const QStringList QuestionsSC = { "Социальное страхование",
                                  "Медиц. обслуживание",
                                  "Жилищные вопросы",
                                  "Организация отдыха работников",
                                  "Услуги (бытовые, спорт, культура и пр.)",
                                  "Контроль в соцсфере",
                                  "Материальная помощь, социальная защита",
                                  "Мероприятия и средства" };
const QStringList ABRQuestionsSC = { "СТР", "МЕД", "ЖИЛ", "ОТД", "УСЛ", "КОН", "МАТ", "МСР" };

//! ТОК | Труд отдельных категорий работников
const QStringList QuestionsTOK = { "Совместители", "Руководители", "Женщины, семейные", "Молодые, учащиеся",
                                   "Гарантии, компенсации" };
const QStringList ABRQuestionsTOK = { "СОВ", "РУК", "ЖЕН", "МОЛ", "ГАР" };

//! ПР | Произв. экон. вопросы
const QStringList QuestionsPR = { "Производственно-экономические", "Внебюджетная деятельность",
                                  "Обязательства сторон" };
const QStringList ABRQuestionsPR = { "ПРЭ", "ВБД", "ОБЯ" };

//! Все вопросы по разделам
const QList<QStringList> QuestionsAtRazdel { QuestionsPSP, QuestionsDOG, QuestionsRV, QuestionsVO,
                                             QuestionsGDP, QuestionsZP,  QuestionsOT, QuestionsTSP,
                                             QuestionsSC,  QuestionsTOK, QuestionsPR };
const QList<QStringList> ABRQuestionsAtRazdel { ABRQuestionsPSP, ABRQuestionsDOG, ABRQuestionsRV, ABRQuestionsVO,
                                                ABRQuestionsGDP, ABRQuestionsZP,  ABRQuestionsOT, ABRQuestionsTSP,
                                                ABRQuestionsSC,  ABRQuestionsTOK, ABRQuestionsPR };

#endif // CCONSTANTS_H
