#ifndef CCONSTANTS_H
#define CCONSTANTS_H

#include <QStringList>
#include <QDate>

const QStringList ListAct = { "КЗОТ | Решение общетрудовых вопросов", "ОБР | Решение отраслевых вопросов (образования)",
                              "ОТС | Решение по вопросам Отраслевого соглашения",
                              "ТРОТС | решение по вопросам Территориального соглашения" };
const QStringList ListRazd = { "ПСП | Социальное партнерство",
                               "ДОГ | Трудовой договор, занятость",
                               "РВ | Рабочее время",
                               "ВО | Время отдыха",
                               "ГДП | Гарантии профкома",
                               "ЗП | Заработная плата",
                               "ОТ | Охрана труда",
                               "ТСП | Трудовые споры",
                               "СЦ | Социально-бытовое обслуживание",
                               "ТОК | Труд отдельных категорий работников",
                               "ПР | Произв. экон. вопросы" };
const QStringList ListQuality = { "Ан | Аналоги положений",
                                  "Ут | Уточнение положений",
                                  "До | Реализация дозволений",
                                  "Вы | Повышение условий",
                                  "Св | Свои, специфические проблемы",
                                  "Др | Другое",
                                  "Фр | Формулировка",
                                  "Ни | Понижение условий" };
const QStringList ListVozmojnosti = { "Неизменяемые параметры", "Устанавливаемые в КД в порядке",
                                      "Повышаемые параметры", "Свои специфические параметры" };
const QStringList AbbreviationAct = { "КЗОТ", "ОБР", "ОТС", "ТРОТС" };
const QStringList AbbreviationRazd = { "ПСП", "ДОГ", "РВ", "ВО", "ГДП", "ЗП", "ОТ", "ТСП", "СЦ", "ТОК", "ПР" };
const QStringList AbbreviationQuality = { "Ан", "Ут", "До", "Вы", "Св", "Др", "Фр", "Ни" };

//!==============================================ВОПРОСЫ==============================================
//! ПСП | Социальное партнерство
const QStringList QuestionsPSP = { "ПЛН | Стороны и их полномочия",
                                   "РСП | Разрешение споров",
                                   "ИЗК | Изменение, заключение и контроль КД",
                                   "ОТВ | Ответственность сторон",
                                   "СДД | Сроки и действие КД",
                                   "ПЕГ | Консультация, переговоры сторон",
                                   "ЦЕЗ | Цель заключения, правовые основы",
                                   "ИНФ | Информирование и знакомство с КД",
                                   "ОБЯ | Обязательства сторон",
                                   "ДРГ | Другие вопросы",
                                   "ОПР | Определения, содержание КД" };
const QStringList ABRQuestionsPSP = { "ПЛН", "РСП", "ИЗК", "ОТВ", "СДД", "ПЕГ", "ЦЕЗ", "ИНФ", "ОБЯ", "ДРГ", "ОПР" };

//! ДОГ | Трудовой договор, занятость
const QStringList QuestionsDOG = { "ЗТД | Заключение ТД",       "СТД | Срок ТД",
                                   "ИТД | Изменение ТД",        "ПК | Повышение квалификации",
                                   "ЗАН | Занятость",           "УВ | Увольнение",
                                   "СОК | Сокращение",          "ГАР | Гарантия, компенсации",
                                   "ОБЯ | Обязательства сторон" };
const QStringList ABRQuestionsDOG = { "ЗТД", "СТД", "ИТД", "ПК", "ЗАН", "УВ", "СОК", "ГАР", "ОБЯ" };

//! РВ | Рабочее время
const QStringList QuestionsRV = { "ПР | Продолжительность РВ", "РЕЖ | Режим работы", "СВХ | Сверхурочные",
                                  "НОР | Нормирование труда",  "ДИС | Дисциплина",   "ГАР | Гарантии, компенсации",
                                  "ОБЯ | Обязательства сторон" };
const QStringList ABRQuestionsRV = { "ПР", "РЕЖ", "СВХ", "НОР", "ДИС", "ГАР", "ОБЯ" };

//! ВО | Время отдыха
const QStringList QuestionsVO = {
    "ПЕР | Перерыв в течение рабочего дня", "ВЫХ | Выходные дни",          "ОТП | Ежегодный отпуск",
    "ДОП | Дополнительный отпуск",          "ГАР | Гарантии, компенсации", "ОБЯ | Обязательства сторон"
};
const QStringList ABRQuestionsVO = { "ПЕР", "ВЫХ", "ОТП", "ДОП", "ГАР", "ОБЯ" };

//! ГДП | Гарантии профкома
const QStringList QuestionsGDP = { "ПКМ | Права профкома, профсоюза",
                                   "УСЛ | Условия предоставляемые для деятельности",
                                   "НЧП | Не члены профсоюза",
                                   "ЛГН | Льготы неосвобожденному профактиву",
                                   "ЛГО | Льготы освобожденному профактиву",
                                   "СОГ | Согласования",
                                   "ЛЧП | Льготы членам профсоюза",
                                   "ОБЯ | Обязательства сторон" };
const QStringList ABRQuestionsGDP = { "ПКМ", "УСЛ", "НЧП", "ЛГН", "ЛГО", "СОГ", "ЛЧП", "ОБЯ" };

//! ЗП | Заработная плата
const QStringList QuestionsZP = { "СИС | Система оплаты",
                                  "НАД | Надбавки",
                                  "ДОП | Доплаты за не нормальные условия",
                                  "СРК | Сроки выплат",
                                  "ИНД | Индексация",
                                  "ВНБ | Внебюджетные средства",
                                  "ПРМ | Премии",
                                  "ГАР | Гарантии, компенсации",
                                  "ОБЯ | Обязательства сторон" };
const QStringList ABRQuestionsZP = { "СИС", "НАД", "ДОП", "СРК", "ИНД", "ВНБ", "ПРМ", "ГАР", "ОБЯ" };

//! ОТ | Охрана труда
const QStringList QuestionsOT = { "СУМ | Средства на ОТ",
                                  "СОГ | Соглашение по ОТ",
                                  "МЕР | Мероприятия по улучшению ОТ",
                                  "АТТ | Аттестация рабочих мест",
                                  "ИСЗ | Обеспечение средствами защиты",
                                  "ПРФ | Страхование и проф. обследование",
                                  "КОН | Контроль за ОТ",
                                  "ГАР | Гарантии, компенсации",
                                  "ОБЯ | Обязательства сторон",
                                  "ОТВ | Ответственность сторон" };
const QStringList ABRQuestionsOT = { "СУМ", "СОГ", "МЕР", "АТТ", "ИСЗ", "ПРФ", "КОН", "ГАР", "ОБЯ", "ОТВ" };

//! ТСП | Трудовые споры
const QStringList QuestionsTSP = { "ЖЛБ | Обращения, жалобы", "ИНД | Индивидуальные", "КОЛ | Коллективные",
                                   "КОМ | Комиссия по труд. спорам" };
const QStringList ABRQuestionsTSP = { "ЖЛБ", "ИНД", "КОЛ", "КОМ" };

//! СЦ | Социально-бытовое обслуживание
const QStringList QuestionsSC = { "СТР | Социальное страхование",
                                  "МЕД | Медиц. обслуживание",
                                  "ЖИЛ | Жилищные вопросы",
                                  "ОТД | Организация отдыха работников",
                                  "УСЛ | Услуги (бытовые, спорт, культура и пр.)",
                                  "КОН | Контроль в соцсфере",
                                  "МАТ | Материальная помощь, социальная защита",
                                  "МСР | Мероприятия и средства" };
const QStringList ABRQuestionsSC = { "СТР", "МЕД", "ЖИЛ", "ОТД", "УСЛ", "КОН", "МАТ", "МСР" };

//! ТОК | Труд отдельных категорий работников
const QStringList QuestionsTOK = { "СОВ | Совместители", "РУК | Руководители", "ЖЕН | Женщины, семейные",
                                   "МОЛ | Молодые, учащиеся", "ГАР | Гарантии, компенсации" };
const QStringList ABRQuestionsTOK = { "СОВ", "РУК", "ЖЕН", "МОЛ", "ГАР" };

//! ПР | Произв. экон. вопросы
const QStringList QuestionsPR = { "ПРЭ | Производственно-экономические", "ВНБ | Внебюджетная деятельность",
                                  "ОБЯ | Обязательства сторон" };
const QStringList ABRQuestionsPR = { "ПРЭ", "ВНБ", "ОБЯ" };

//! Все вопросы по разделам
const QList<QStringList> QuestionsAtRazdel { QuestionsPSP, QuestionsDOG, QuestionsRV, QuestionsVO,
                                             QuestionsGDP, QuestionsZP,  QuestionsOT, QuestionsTSP,
                                             QuestionsSC,  QuestionsTOK, QuestionsPR };
const QList<QStringList> ABRQuestionsAtRazdel { ABRQuestionsPSP, ABRQuestionsDOG, ABRQuestionsRV, ABRQuestionsVO,
                                                ABRQuestionsGDP, ABRQuestionsZP,  ABRQuestionsOT, ABRQuestionsTSP,
                                                ABRQuestionsSC,  ABRQuestionsTOK, ABRQuestionsPR };
//!==============================================Таблица ТЗакон==============================================
struct structOrder {
    qint32 id;
    QString name;
    QDate dateAdoptation;
    QDate dateChange;
};
// TODO: [Улучшение кода] можно переделать потом это в паттерн синглтон
extern QList<structOrder *> TOrder;

#endif // CCONSTANTS_H
